Revit 2022 API
AnalyticalModelSurface.HideOpening Method
 Hides set of curves originating from Opening.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2013
Syntax
C#
public bool HideOpening(
	ElementId openingId
)
Visual Basic
Public Function HideOpening ( _
	openingId As ElementId _
) As Boolean
Visual C++
public:
bool HideOpening(
	ElementId^ openingId
)
Parameters
openingId
Type: Autodesk.Revit.DB.ElementId
 Opening to hide in analytical surface.
Return Value
 True if given opening was hidden (operation was successful).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  openingId is invalid for Analytical Model Surface.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AnalyticalModelSurface Class
Autodesk.Revit.DB.Structure Namespace